Revit 2024 API
EdgeArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual EdgeArrayIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As EdgeArrayIterator
Visual C++
public:
virtual EdgeArrayIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the array.
See Also
EdgeArray Class
Autodesk.Revit.DB Namespace